<?php

switch ($bazgashti) {
    case "-1":
        echo 'اطلاعات ارسال شده ناقص است';
        break;
	case "-2":
        echo 'IP و يا مرچنت كد پذيرنده صحيح نيست';
        break;
	case "-3":
        echo 'با توجه به محدوديت هاي شاپرك امكان پرداخت با رقم درخواست شده ميسر نمي باشد';
        break;
	case "-4":
        echo 'سطح تاييد پذيرنده پايين تر از سطح نقره اي است';
        break;
	case "-11":
        echo 'درخواست مورد نظر يافت نشد';
        break;
	case "-12":
        echo 'امكان ويرايش درخواست ميسر نمي باشد';
        break;
	case "-21":
        echo 'هيچ نوع عمليات مالي براي اين تراكنش يافت نشد';
        break;
	case "-22":
        echo 'تراكنش نا موفق مي باشد';
        break;
	case "-33":
        echo 'رقم تراكنش با رقم پرداخت شده مطابقت ندارد';
        break;
	case "-34":
        echo 'سقف تقسيم تراكنش از لحاظ تعداد يا رقم عبور نموده است';
        break;
	case "-40":
        echo 'اجازه دسترسي به متد مربوطه وجود ندارد';
        break;
	case "-41":
        echo 'اطلاعات ارسال شده مربوط به AdditionalData غيرمعتبر مي باشد .';
        break;
	case "-42":
        echo 'مدت زمان معتبر طول عمر  شناسه  پرداخت بايد بين 30دقيه تا 45روز مي باش';
        break;
	case "-54":
        echo 'درخواست مورد نظر آرشيو شده است .';
        break;
	case "101":
        echo 'عمليات پرداخت موفق بوده وقبلا PaymentVerification تراكنش انجام شده است';
        break;
	case "100":
        echo 'عملیات با موفقیت انجام شد';
        break;
}
